#include "bsp_task.h"


/**************************************************************************************************
*					功能描述:
*							 任务通知学习(模拟事件组(标志位))
*							 
*							 
*							 
*							 
*					任务通知
*							1.无需创建
*						    2.任务/中断均能发送通知
*						    3.只有任务可以等待通知，中断中不允许等待通知
*							4.任务通知只能有一个接收任务
*								
**************************************************************************************************/

//			优先级:数字越大，优先级越高

/**************************************************************************************************
*		   当多个任务具有相同的部分时，可以通过传入参数改变,从而不用创建多个任务
*		   当使用软件延时函数时，不会出现阻塞态，创建多个任务时，只有高优先级的任务运行
*		   当采用vTaskDelay()函数时，会出现阻塞态，多个任务会轮流执行，
*		   因此每个任务执行都有必要的延时，否则会出现高优先级任务一直占用CPU
**************************************************************************************************/

/**************************************************************************************************
*									变量定义
**************************************************************************************************/


/**************************************************************************************************
*									任务句柄
**************************************************************************************************/
TaskHandle_t AppTaskCreate_Handle = NULL;		//创建任务任务句柄

TaskHandle_t taskSend_Handle = NULL;			//创建任务任务句柄
TaskHandle_t taskReceive_Handle = NULL;			//创建任务任务句柄

/********************************************************************************************
*	描	述:任务创建任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void AppTaskCreate(void *parameter)
{
	BaseType_t xReturn;
	taskENTER_CRITICAL();	//进入临界区
			
	//创建按键任务
	 xReturn = xTaskCreate(taskSend,"taskSend",126,NULL,4,&taskSend_Handle);
	if(pdPASS == xReturn)
	{
		printf("taskSend创建成功\n");
	}
	
	xReturn = xTaskCreate(taskReceive,"taskReceive",126,NULL,3,&taskReceive_Handle);
	if(pdPASS == xReturn)
	{
		printf("taskReceive_Handle创建成功\n");
	}
	
	vTaskDelete(AppTaskCreate_Handle);
	taskEXIT_CRITICAL();	//退出临界区
}



/********************************************************************************************
*	描	述:任务通知发送任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void taskSend(void *parameter)
{
	while(1)
	{
		if(KEY_ON == KEY_Scan(KEY1_GPIO_PORT,KEY1_GPIO_PIN))
		{
			LED1_Toggle();
			//发送任务通知给接收任务1
			xTaskNotify(taskReceive_Handle,1,eSetBits);
		}
		
		if(KEY_ON == KEY_Scan(KEY2_GPIO_PORT,KEY2_GPIO_PIN))
		{
			LED2_Toggle();
			//发送任务通知给接收任务1
			xTaskNotify(taskReceive_Handle,2,eSetBits);;
		}
		
		vTaskDelay(20);
	}
}


/********************************************************************************************
*	描	述:任务通知接收任务函数1
*	参	数:无
*	返回值:无
********************************************************************************************/
void taskReceive(void *parameter)
{
	uint32_t Value_data =0;
	
	while(1)
	{
		LED1_Toggle();
		xTaskNotifyWait(0x00,0xFF,&Value_data,portMAX_DELAY);
		if(Value_data == 1)
		{
			printf("KEY1被按下\n");
		}
		if(Value_data == 2)
		{
			printf("KEY2被按下\n");
		}
		vTaskDelay(20);
	}
}





