#include "bsp_task.h"


/**************************************************************************************************
*					功能描述:
*							 FreeRTOS软件定时器学习
*							 创建两个定时器，一个是单次，一个是周期
*							 使用按键1启动两个定时器，使用按键2关闭周期定时器
*							 
*							 
*					注意点:1.软件定时器在被创建之后，当经过设定的时钟计数值后会触发用户定义的回调函数
*							 回调函数相当于中断服务函数，应快进快出 ，并且回调函数中不能出现任何阻塞任务运行的API
*						   2.软件定时器用于对定时精度要求不高的地方
*						   3.软件定时器不属于FreeRTOS的内核功能，使用时需要打开宏configUSE_TIMERS
*								
**************************************************************************************************/

//			优先级:数字越大，优先级越高

/**************************************************************************************************
*		   当多个任务具有相同的部分时，可以通过传入参数改变,从而不用创建多个任务
*		   当使用软件延时函数时，不会出现阻塞态，创建多个任务时，只有高优先级的任务运行
*		   当采用vTaskDelay()函数时，会出现阻塞态，多个任务会轮流执行，
*		   因此每个任务执行都有必要的延时，否则会出现高优先级任务一直占用CPU
**************************************************************************************************/

/**************************************************************************************************
*									变量定义
**************************************************************************************************/
uint16_t i = 1;
uint16_t j = 1;

/**************************************************************************************************
*									任务句柄
**************************************************************************************************/
TaskHandle_t AppTaskCreate_Handle = NULL;		//创建任务任务句柄

TimerHandle_t  periodTimer_Handle = NULL;			//周期定时器句柄
TimerHandle_t  oneTimer_Handle = NULL;				//单次定时器句柄

/********************************************************************************************
*	描	述:任务创建任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void AppTaskCreate(void *parameter)
{
	BaseType_t xReturn;
	taskENTER_CRITICAL();	//进入临界区
	
	//创建软件周期定时器
	periodTimer_Handle = xTimerCreate("周期定时器",pdMS_TO_TICKS(1000),pdTRUE,(void *)1,Period_CallBack);		
	if(NULL != periodTimer_Handle)
	{
		printf("周期定时器创建成功\n\n");
	}
	
	//创建软件单次定时器
	oneTimer_Handle = xTimerCreate("单次定时器",pdMS_TO_TICKS(800),pdFALSE,(void *)2,oneTime_CallBack);
	if(NULL != oneTimer_Handle)
	{
		printf("单次定时器创建成功\n");
	}
	
	//创建按键任务
	 xReturn = xTaskCreate(KEY_ControlTask,"KEY_ControlTask",126,NULL,2,NULL);
	if(pdPASS == xReturn)
	{
		printf("key1按键任务创建成功\n\n");
	}
	vTaskDelete(AppTaskCreate_Handle);
	taskEXIT_CRITICAL();	//退出临界区
}


/********************************************************************************************
*	描	述:周期定时器回调函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void Period_CallBack(TimerHandle_t xTimer)
{
	LED1_Toggle();
	printf("进入周期定时回调函数%d次\n",i++);
}


/********************************************************************************************
*	描	述:当多个标志位满足时才执行任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void oneTime_CallBack(TimerHandle_t xTimer)
{
	LED2_Toggle();
	printf("进入单次定时回调函数%d次\n\n",j++);
}


/********************************************************************************************
*	描	述:按键控制软件定时器任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void KEY_ControlTask(void *parameter)
{
	while(1)
	{
		//key1按下开启定时器
		if(KEY_ON == KEY_Scan(KEY1_GPIO_PORT,KEY1_GPIO_PIN))
		{
			printf("key1按下\n");
			//启动周期定时器
			xTimerStart(periodTimer_Handle,0);
			//启动单次定时器
			xTimerStart(oneTimer_Handle,0);
		}
		//key2按下关闭定时器
		if(KEY_ON == KEY_Scan(KEY2_GPIO_PORT,KEY2_GPIO_PIN))
		{
			printf("\n");
			printf("key2按下\n");
			xTimerStop(periodTimer_Handle,0);
			printf("关闭周期定时器\n");
		}
	}
}
