#include "bsp_task.h"


/**************************************************************************************************
*			当多个任务具有相同的部分时，可以通过传入参数改变,从而不用创建多个任务
*		   当使用软件延时函数时，不会出现阻塞态，创建多个任务时，只有高优先级的任务运行
*		   当采用vTaskDelay()函数时，会出现阻塞态，多个任务会轮流执行
**************************************************************************************************/

/**************************************************************************************************
*									存放由用户编写的相关任务
**************************************************************************************************/



/**************************************************************************************************
*									任务句柄
**************************************************************************************************/
static TaskHandle_t LED1_Task_Handle = NULL;
TaskHandle_t AppTaskCreate_Handle = NULL;


/********************************************************************************************
*	描	述:任务创建任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void AppTaskCreate(void *parameter)
{
	taskENTER_CRITICAL();	//进入临界区
	xTaskCreate(LED1_Task,
				"Task1",
				126,
				NULL,
				2,
				&LED1_Task_Handle);
	xTaskCreate(KEY_Task,
				"KEY_Task",
				126,
				NULL,
				3,
				NULL);
	vTaskDelete(AppTaskCreate_Handle);
	taskEXIT_CRITICAL();	//退出临界区
}


/********************************************************************************************
*	描	述:LED1点亮任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void LED1_Task(void *parameter)
{	uint32_t i = 0;
	while(1)
	{
		LED1(1);
		printf("LED1 is On\n");
		vTaskDelay(500);
		
		LED1(0);
		printf("LED1 is Off\n");
		vTaskDelay(500);
		i++;
		printf("%d\n",i);
	}
}


/********************************************************************************************
*	描	述:LED2点亮任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void LED2_Task(void *parameter)
{	
	while(1)
	{
		LED2(1);
		printf("LED2 is On\n");
		vTaskDelay(500);
		
		LED2(0);
		printf("LED2 is Off\n");
		vTaskDelay(500);
	}
}


/********************************************************************************************
*	描	述:按键扫描任务函数
*	参	数:无
*	返回值:无
********************************************************************************************/
void KEY_Task(void *parameter)
{	
	while(1)
	{
		if(KEY_Scan(KEY1_GPIO_PORT,KEY1_GPIO_PIN) == KEY_ON)
		{
			printf("LED1任务挂起\n");
			vTaskSuspend(LED1_Task_Handle);	//挂起LED1
			printf("LED1任务挂起成功\n");
		}
		if(KEY_Scan(KEY2_GPIO_PORT,KEY2_GPIO_PIN) == KEY_ON)
		{
			printf("LED1任务恢复\n");
			vTaskResume(LED1_Task_Handle);
			printf("LED1任务恢复成功\n");
		}
		vTaskDelay(500);
	}
}
