#include "stm32f10x.h"
#include "bsp_led.h"
#include "FreeRTOS.h"			  
#include "task.h" 
#include "bsp_task.h"
#include "bsp_key.h"

/**************************************************************************************************
*		动态任务创建步骤
*					1.创建任务函数
*					2.创建任务创建APPTaskCreate函数
*					3.在APPTaskCreate函数创建任务函数，创建成功后，删除APPTaskCreate函数
*				   需要在FreeRTOSConfig.h文件中开启configSUPPORT_DYNAMIC_ALLOCATION宏
**************************************************************************************************/


/**************************************************************************************************
*									任务句柄
**************************************************************************************************/
extern TaskHandle_t AppTaskCreate_Handle;

/**************************************************************************************************
*									函数声明
**************************************************************************************************/
static void BSP_Init(void);


/**************************************************************************************************
*									变量定义
**************************************************************************************************/


/**************************************************************************************************/
int main(void)	
{
	//开发板硬件初始化
	BSP_Init();
	printf("初始化完成\n");

	//创建任务
	 xTaskCreate(AppTaskCreate,"APPTaskCreate",512,NULL,1,&AppTaskCreate_Handle);
		
	//启动任务调度器
	vTaskStartScheduler();
	while(1);	//正常执行不会到这里来
}

/********************************************************************************************
*	描	述:与开发板相关的板级外设
*	参	数:无
*	返回值:无
********************************************************************************************/
static void BSP_Init(void)
{
	//stm32的优先级分组,全部用于抢占优先级
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
	
	/* LED初始化 */
	Led_Init();
	
	/*串口初始化 */
	UART_Init();
	//按键初始化
	KEY_Init();
}

